{"@context":"http://schema.org","@type":"Recipe","mainEntityOfPage":true,"name":"Cape Fear Punch","url":"https://www.foodnetwork.com/recipes/alton-brown/cape-fear-punch-recipe-1917913","headline":"Cape Fear Punch","author":[{"@type":"Person","name":"Alton Brown","url":"https://www.foodnetwork.com/profiles/talent/alton-brown"}],"image":{"@type":"ImageObject","url":"https://food.fnr.sndimg.com/content/dam/images/food/video/0/01/017/0174/0174967.jpg.rend.hgtvcom.406.229.suffix/1479071298334.jpeg","height":"406","width":"305"},"datePublished":"2015-05-30T10:10:50.395-04:00","dateModified":"2015-02-18T16:00:33.330-05:00","publisher":{"@type":"Organization","name":"Food Network","url":"https://www.foodnetwork.com","logo":{"@type":"ImageObject","url":"https://food.fnr.sndimg.com/etc/clientlibs/assets/images/food/fn-logo-flat-60x60.png","height":"60","width":"60"}},"keywords":"Mixed Drink Recipes,Punch Recipes,Fruit,Lemon,Wine Recipes,Sugar,Whiskey Recipes,Brandy,Cocktail Party,Recipes for Parties,Recipes for a Crowd","prepTime":"P0Y0M0DT0H30M0.000S","totalTime":"P0Y0M1DT0H30M0.000S","recipeIngredient":["750 ml rye whiskey","750 ml water","1/2 cup Demerara sugar","3 bags green tea","375 ml rum","375 ml Cognac","4 whole lemons","2 small oranges, thinly sliced","4 small lemons, thinly sliced","2 (750 ml) bottles sparkling wine or Champagne","1 liter seltzer or sparkling water","Ice block","Freshly grated nutmeg"],"recipeInstructions":[{"@type":"HowToStep","text":"For the base:"},{"@type":"HowToStep","text":"Pour the rye whiskey into a 4-quart container. Fill the now empty rye whiskey bottle with water, pour into an electric kettle, and bring to a boil. Add the sugar and stir until the temperature drops to 190 degrees F. Place the tea bags in the kettle and steep for 3 minutes."},{"@type":"HowToStep","text":"Add the tea, rum, and Cognac to the whiskey. Peel the zest from the lemons, being careful to remove the white pith. Wrap the lemon bodies in plastic wrap and reserve in the refrigerator. Add the lemon zest to the mixture, and stir to combine. Cover and refrigerate overnight."},{"@type":"HowToStep","text":"For the punch:"},{"@type":"HowToStep","text":"Strain the base into a large punch bowl. Juice the reserved lemon bodies and add to the punch bowl. When ready to serve, add the oranges, lemons, sparkling wine, and seltzer water; stir to combine. Add the ice block and serve with freshly grated nutmeg."}],"aggregateRating":{"@type":"AggregateRating","ratingValue":4.7,"reviewCount":12},"recipeYield":"approximately 160 ounces or 40 (4-ounce) servings","review":[{"@type":"Review","author":{"@type":"Person","name":"Anonymous"},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"We had such a great time making this, and it was a huge hit. We watched the Good Eats episode about the punch and felt like we were drinking a part of history. We look forward to making it again!","datePublished":"2021-09-18"},{"@type":"Review","author":{"@type":"Person","name":"east.tn.cooker"},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"I have made this punch several times, for the holidays last year for my family, and for a friends wedding reception this year (It was my wedding gift.  On a per drink cost this is not too expensive. The taste is special, as other reviewers have noted- not too sweet.  Even my wife who dislikes the thought of whiskey liked this one.  I left the second half of the mix at my friend's reception, which her brother took for a reprise for the family breakfast the next day.  Total success.","datePublished":"2013-01-14"},{"@type":"Review","author":{"@type":"Person","name":"laughingmom"},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"We do this punch every year for the 4th of july. Its the best part of the festivities for everyone of drinking age I think. People don't expect it to be so refreshing and clean tasting. I opt for the barefoot champagne since its cheap and still adds a nice flavor. Definitely something to do to show off for friends and family.","datePublished":"2011-10-28"},{"@type":"Review","author":{"@type":"Person","name":"Anonymous"},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"Made this for NYE - Everyone loved it!! It was great to have REAL punch for a change!  Be forwarned- it's  strong one.  Not for the \"Sex in the City crowd\". I would recommend for any gathering of people who enjoy a good drink!","datePublished":"2011-01-02"},{"@type":"Review","author":{"@type":"Person","name":"Lauren S."},"reviewRating":{"@type":"Rating","ratingValue":3,"worstRating":"1","bestRating":"5"},"reviewBody":"The punch was just okay. Made it for a NYE party and while I liked it, it wasn't a hit. Tasted too boozey for everyone. Not worth it for the cost of all the ingredients.","datePublished":"2011-01-01"},{"@type":"Review","author":{"@type":"Person","name":"apbryant"},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"Absolutely delicious. Sour and sweet, yet more and more tasty as the night goes on. Remember that most everything is a mixer, so don't spend a ton of money on the champagne or rye. The cognac needs to be nice, but still not too expensive. Just get middle of the road on everything and it won't cost more that $50. I made this for a Christmas party and it was a HUGE hit. Everyone was amazed that it has \"that much alcohol\" and yet still tasted great. Fun and functional, perfect for a party.","datePublished":"2010-12-25"},{"@type":"Review","author":{"@type":"Person","name":"Andrew M."},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"Followed the recipe to the letter, including the balloon ice eggs.  Like other reviewers I found the punch pleasantly dry.  Try not to skip the nutmeg, it really does add a little something extra.  Everyone at the party really enjoyed the punch, and we still had half of the second batch left in the mornings.  More than enough booze for 10 people.","datePublished":"2010-04-07"},{"@type":"Review","author":{"@type":"Person","name":"LIZ L."},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"This punch was phenomenal.  I served it for NYE and 10 of us finished it in under 3 hours. Everybody raved about it and nobody drove home, that's for sure!  \r<br />\r<br />As other reviewers noted - it's got an indesribable flavor at first. It does NOT taste as alcoholic as it is, certainly not like whiskey (or rum, or congnac for that matter).  It is not sweet - only 1/2 c sugar in the whole batch and no cloying fruit juice. If you are looking for a \"foofy\" punch, look elsewhere. This is a clean, refreshing flavor. I found it looking for a champagne punch for NYE but it would just as apt at a summer party with the citruis &amp; tea notes.\r<br />\r<br />I t is very expensive to make (realized I purchased over $70 of alchohol for this punch alone!!! - wonder if brandy would have been as good as the cognac?) but the fact that I wished so many happy new year via phone and do not recall doing so yet suffered no unpleasant hangover made it worth it!\r<br />\r<br />","datePublished":"2010-01-02"},{"@type":"Review","author":{"@type":"Person","name":"Steven F."},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"Decided to try it for a get together party of about 20 to 25 individuals. Everyone's reaction to it was disbelief how fantastic this punch tasted, including several people who DO NOT like whiskey. I was worried that it wouldn't go far but it lasted throughout the evening. In fact, I would say it made the perfect amount. Definitely give it a shot if you wanna get seriously juiced while maintiaining a nice measure of refinement.","datePublished":"2009-12-26"},{"@type":"Review","author":{"@type":"Person","name":"S P."},"reviewRating":{"@type":"Rating","ratingValue":4,"worstRating":"1","bestRating":"5"},"reviewBody":"The very first sip of this punch can leave you a little puzzled if not slightly disappointed, BUT after only one or two more sips your palette will  adjust and you will start to notice and appreciate the subtle nuance of this interesting blend of flavors ... and then you will be hooked. \r<br />\r<br />WARNING: This punch can be dangerous because it sneaks up on you... the high alcohol content is very well masked behind its flavor profile, yet it is also blended proportionally so that you can consume fairly large amounts (say on a hot day) without overdoing it. \r<br />\r<br />The freshly ground nutmeg makes quite the difference so don't leave it out! ","datePublished":"2009-07-04"}],"video":{"@type":"VideoObject","name":"Alton's Cape Fear Punch Recipe","description":"Don't be afraid to make Alton's Cape Fear Punch recipe for your next party.","duration":"PT0H3M29S","thumbnailUrl":"https://food.fnr.sndimg.com/content/dam/images/food/video/0/01/017/0174/0174967.jpg.rend.hgtvcom.406.229.suffix/1479071298334.jpeg","contentUrl":"https://www.foodnetwork.com/videos/altons-cape-fear-punch-recipe-0174967","embedUrl":"http://link.theplatform.com/s/ip77QC/1tA8LKBKA8nB?&format=SMIL&MBR=true","uploadDate":"2018-11-06T17:04:06.639-05:00"},"recipeCategory":"beverage"}