{"@context":"http://schema.org","@type":"Recipe","mainEntityOfPage":true,"name":"Good Eats Company Punch","url":"https://www.foodnetwork.com/recipes/alton-brown/good-eats-company-punch-recipe-1948159","headline":"Good Eats Company Punch","author":[{"@type":"Person","name":"Alton Brown","url":"https://www.foodnetwork.com/profiles/talent/alton-brown"}],"image":{"@type":"ImageObject","url":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2013/12/9/1/FN_Guy-Fieri_Good-Eats-Company-Punch_s4x3.jpg.rend.hgtvcom.406.305.suffix/1387411421933.jpeg","height":"406","width":"305"},"datePublished":"2015-05-30T10:10:16.614-04:00","dateModified":"2014-10-09T11:50:38.405-04:00","publisher":{"@type":"Organization","name":"Food Network","url":"https://www.foodnetwork.com","logo":{"@type":"ImageObject","url":"https://food.fnr.sndimg.com/etc/clientlibs/assets/images/food/fn-logo-flat-60x60.png","height":"60","width":"60"}},"keywords":"American,Punch Recipes,Sugar,Rum Recipes,Fruit,Lime Recipes,Recipes for Parties,Cocktail Party,Recipes for a Crowd","prepTime":"P0Y0M0DT0H20M0.000S","totalTime":"P0Y0M0DT1H20M0.000S","recipeIngredient":["16 ounces freshly squeezed lime juice, bodies reserved, about 20 limes","32 ounces Demerara sugar","64 ounces warm black tea","48 ounces Batavia Arrack","Ice block","Freshly grated nutmeg"],"recipeInstructions":[{"@type":"HowToStep","text":"Combine the juice, lime bodies and sugar in a 5-quart container. Add the tea and stir until the sugar dissolves completely, 2 to 3 minutes. Add the Batavia Arrack and stir to combine. Chill to at least 40 degrees, approximately 1 hour in the refrigerator."},{"@type":"HowToStep","text":"Strain the punch into a punch bowl over a large ice block and serve with freshly grated nutmeg."}],"aggregateRating":{"@type":"AggregateRating","ratingValue":4.4,"reviewCount":9},"recipeYield":"approximately 30 (4-ounce) servings","review":[{"@type":"Review","author":{"@type":"Person","name":"Charlie B."},"reviewRating":{"@type":"Rating","ratingValue":1,"worstRating":"1","bestRating":"5"},"reviewBody":"No, pretty bad.<div>I literally purchased ALL of the exact ingredients. Including two bottles of actual Batavia Arrack rum. I juiced the limes, bought the raw cane sugar, and true black tea brewed to exacting standards.</div><div><br /><div>Sickly sweet, flowery, tastes only of raw sugar, and coats the inside of your mouth. That's pretty much ALL I could taste. I tossed the lot. Does not AT ALL taste like Long Island Iced Tea as suggested. </div></div><div>If you like a drink that is so sweet that it makes your eyes cross then this is for you. </div>","datePublished":"2020-06-20"},{"@type":"Review","author":{"@type":"Person","name":"forest w."},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"This recipe was fantastic and simple. So simple, I was able to memorize it. A few days ago I was at a party, and we were running low on beer. But, alas, for some inexplicable but fortunate reason, the host just happened to have all the ingredients(though i did have to sub the arrack for some golden rum. So I mixed up a quick batch and it was quite the crowd pleaser.  I will defiantly make this again, and so will many of the people at the party, because quite a few asked for the recipe.","datePublished":"2013-05-18"},{"@type":"Review","author":{"@type":"Person","name":"WillzGal"},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"My husband and I were looking for something different to bring to our Thanksgiving party this year and we found it! We had a similar problem as most and substituted with half and half Rum. Because we where pressed for time, we only squeezed 8 limes and used store bottled lime juice for the difference, but it was delicious! I understand some would find it too sweet, it didn't bother us and we received numerous compliments throughout the event. Definately will add to my collection of recipes and make again.","datePublished":"2009-12-03"},{"@type":"Review","author":{"@type":"Person","name":"Cindy F."},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"I made this for Thanksgiving.  Everyone really enjoyed it (8 adults were present).  I special ordered the Batavia-Arrack from an online liquor store, and it was well worth it.  Not particularly expensive, considering, and it was quite unique (had a few sips of it prior to using).  The Batavia-Arrack did *not* taste like rum.  It tasted like (from my own unique palate): a very smooth Islay Scotch (whisky), with strong hints of molasses and tequila.\r<br />\r<br />The punch was a big hit and I hope to make it again.  It was a pain in the rear to juice the limes by hand though. :)  I did use less sugar, as previously recommended.  I used about 24 oz. of demarara, and it was not at all syrupy.  It was perfect.  I couldn't get a whole nutmeg to grate, but the punch was still yummy.","datePublished":"2009-12-01"},{"@type":"Review","author":{"@type":"Person","name":"LIANNE M."},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"this has become a staple at parties around here, typically we change out for gold/dark rum.  works just as well.","datePublished":"2009-10-03"},{"@type":"Review","author":{"@type":"Person","name":"micheal m."},"reviewRating":{"@type":"Rating","ratingValue":4,"worstRating":"1","bestRating":"5"},"reviewBody":"I got the Batavia-Arrack online.  I have alcohol shipped to me all the time, so no big deal ordering it from NY.  Now the big thing we could not deal with was the sweetness.  This is way, way, way too sweet as the recipe is written.  The second time we made it we halved the sugar.  It is still really sweet ;)  If you make it as the recipe states it is cloyingly sweet.  It's like drinking syrup.  If you half the sugar it is is about as sweet as a good sweet tea.  Other than the sugar issue it is great tasting.  By lowering the sugar you can taste the rest of the ingredients and it becomes a more balanced drink.  Perhaps punches are supposed to be that sweet, but we prefer a more balanced \"cocktail\".\r<br />\r<br />I DO NOT think you can reliably substitute another liquor for the Batavia-Arrack and get the same drink (it does not really taste like rum).  There is nothing I have ever tasted that really tastes like it.  Do yourself a favor and have a bottle shipped to you.  You can also use it in baking as it has a unique property of bringing out other flavors.  It is a highly sought after \"secret\" ingredient of professional pastry chefs.  It is available online from a prominent retailer in NY, just google it and you will find it ;)\r<br />","datePublished":"2009-10-02"},{"@type":"Review","author":{"@type":"Person","name":"Dorothy W."},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"I had to sub rum for Batavia Arrack. Used 50/50 white rum and gold rum. This was a huge hit at my July 4th party. If it is too strong for some guests, it can be topped off with ginger ale or ginger beer and it still tastes great. I might back off the sugar on the next go round- it was a little too sweet, IMHO. \r<br />Overall, something different and fun for gatherings. More inspired that margaritas or daiquiris!","datePublished":"2009-09-07"},{"@type":"Review","author":{"@type":"Person","name":"Ben B."},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"I could not find Arrack so I used Gold Rum and Brandy mixed 50.50 to make up the volume of the strong.\r<br />\r<br />It was a huge hit at the party.  I may use mint as a garnish next time rather than nutmeg.\r<br />\r<br />Beware though, it ends up about 30 proof, but does not taste anywhere near that boozy...","datePublished":"2009-09-05"},{"@type":"Review","author":{"@type":"Person","name":"Evil S."},"reviewRating":{"@type":"Rating","ratingValue":5,"worstRating":"1","bestRating":"5"},"reviewBody":"Beware this punch is deceptively potent! It tastes great, you won't realize you're drinking a 40 proof punch, so make sure you use small glasses!\r<br />\r<br />As it was last minute, I couldn't get the Batavia Arrack, so I substituted a 750ml bottle of gold rum and 750ml of Brazillian Cachaca, and it was still excellent.","datePublished":"2009-09-01"}],"video":{"@type":"VideoObject","name":"Good Eats Company Punch","description":"Guests coming? Good Eats Company Punch will make them feel right at home.","duration":"PT0H3M12S","thumbnailUrl":"https://food.fnr.sndimg.com/content/dam/images/food/video/0/01/017/0174/0174968.jpg.rend.hgtvcom.406.229.suffix/1479071298583.jpeg","contentUrl":"https://www.foodnetwork.com/videos/good-eats-company-punch-0174968","embedUrl":"http://link.theplatform.com/s/ip77QC/J9H_s9_UT7Um?&format=SMIL&MBR=true","uploadDate":"2018-11-06T17:04:26.999-05:00"},"recipeCuisine":"american","recipeCategory":"beverage"}